[
  {
    "name":"Alicia Cheng",
    "shortname":"Alicia_Cheng",
    "company":"MGMT",
    "bio":"Alicia Cheng is a founding partner of MGMT. She has worked as a senior designer for Method, New York and was the co-design director at the Cooper-Hewitt, National Design Museum. She has taught and served as a visiting critic at Yale University, Princeton University, the Maryland Institute College of Art, and the Cooper Union School of Art. She currently serves as an external critic for the MFA program at the Rhode Island School of Design. Alicia received her BA from Barnard College and her MFA from Yale University."
  },
  {
    "name":"Amy Lee Walton",
    "shortname":"Amy_Lee_Walton",
    "company":"Mapbox",
    "bio":"Amy Lee Walton designs at the intersection of data and context. Serving as designer and navigator at platform company, Mapbox, Amy Lee never wants to experience a bad map again. At Mapbox she works as Designer, Experience and Engagement Lead where she explains complex mapping and cartographic concepts while building bridges to help designers push the future of mapping experiences. She has led workshops at the North American Cartographic Information Society (NACIS), Design Week Portland, Design Week Tallahassee, and Baltimore Data Day. Her work has been featured in Communication Arts (CA) Insights, Wired Design, the Revision Path podcast, NPR: All Tech Considered, and The Atlas of Design, Volume III."
  },
  {
    "name":"Gail Bichler",
    "shortname":"Gail_Bichler",
    "company":"The New York Times Magazine",
    "bio":"Gail Bichler is the design director of The New York Times Magazine where she and her team have won numerous awards for their print and interactive design, including Magazine of the Year from the Society of Publication Designers in 2016 and Design Team of the Year in 2015 from the Art Directors Club. In addition, Gail’s work has been recognized by national and international design organizations including D&AD, the American Institute for Graphic Arts, the Type Directors Club and Creative Review."
  },
  {
    "name":"Jennifer Daniel",
    "shortname":"Jennifer_Daniel",
    "company":"Talk to Me",
    "bio":"Jennifer Daniel is an author, designer, and illustrator who spends her days at Google working in a combination of machine learning, augmented reality and other buzzwords. In a previous life, she was a journalist and graphics editor at the New York Times."
  },
  {
    "name":"Ken Barber",
    "shortname":"Ken_Barber",
    "company":"House Industries, Type & Lettering",
    "bio":"Ken Barber is the typeface design director and chief lettering officer at font foundry and design studio, House Industries. His work is in the permanent collection of the Smithsonian Institution’s Cooper-Hewitt National Design Museum and the Henry Ford Museum of American Innovation. Ken has also been honored by the New York Type Directors Club, Association Typographique Internationale, and Design Museum London. In addition to teaching at The Cooper Union in New York City, he regularly leads workshops on the practice of hand-lettering. Ken co-authored House Industries: The Process is the Inspiration (Watson-Guptill, 2017) with Andy Cruz and Rich Roat."
  },
  {
    "name":"Lance Wyman",
    "shortname":"Lance_Wyman",
    "company":"Lance Wyman Ltd.",
    "bio":"Lance Wyman was born 1937 in Newark, New Jersey, and studied Industrial Design at Pratt Institute in Brooklyn. After working at General Motors in Michigan and George Nelson in New York he went to Mexico City and designed the graphics for the 1968 Olympics, the Metro rail system, and the 1970 World Cup of Soccer. He returned to New York in 1971 and designed the Washington DC Metro maps and wayfinding systems that include the National Zoo, National Mall and Minnesota Zoo. He is currently working on Mexico City Metrobus wayfinding. He is a member of AGI, an SEGD Fellow and a recipient of the AIGA Medal. There are three major books published on his work."
  },
  {
    "name":"Massimo Pitis",
    "shortname":"Massimo_Pitis",
    "company":"Pitis",
    "bio":"Massimo Pitis is the founder of Pitis e Associati, a design and consultancy studio based in Milan and Paris, working with clients such as CCA Montreal, FAI, Fabriano, Antonia Milano, Skira Paris, Esperia, Museo del Novecento, Triennale di Milano, Rizzoli, Romeo Sozzi, Flammarion, Condé Nast, Giorgio Armani, Bulgari. He’s art director of Wired Italia, which was awarded Best Magazine Redesign 2015 and Magazine of the Year 2016 by the SPD in New York. Prior to that, as a creative director at Landor Associates Italia, he specialized in brand identity and exhibition design, and curated Lettera, the graphic design section of Abitare magazine. In 2001 he was awarded the first prize for corporate identity by the Art Directors Club Italiano. In 2005 he was the curator of the exhibition and catalogue “Pino Tovaglia – La regola che corregge l’emozione” edited by Corraini. He’s a member of the TDC (Type Directors Club) and chaired BEDA (Bureau of European Design Associations) 2002–2006. He runs workshops at IUAV University in Venice and at Politecnico in Milan."
  },
  {
    "name":"Peter Biľak",
    "shortname":"Peter_Bilak",
    "company":"Typotheque",
    "bio":"Peter Biľak works in the field of editorial, graphic, and type design. In 1999 he started Typotheque type foundry, in 2000, together with Stuart Bailey he co-founded art & design journal Dot Dot Dot, in 2012 he started Works That Work, a magazine of unexpected creativity, in 2015 together with Andrej Krátky he co-founded Fontstand.com, a font rental platform. Peter is teaching at the Type & Media, postgraduate course at the Royal Academy of Arts, The Hague."
  },
  {
    "name":"Silas Munro",
    "shortname":"Silas_Munro",
    "company":"Polymode",
    "bio":"Silas Munro is a partner of Poly-Mode. His studio has collaborated with MoMA, The Baltimore Museum of Art, Mark Bradford, and the Wynwood Arts District. Munro’s writing appears in Slanted, Walker Gradient, and a forthcoming book, W. E. B. Du Bois’s Data Portraits: Visualizing Black America published by Princeton Architectural Press. He has been a visiting critic at MICA, RISD, and Yale University. Munro is Assistant Professor at Otis College of Art and Design and advisor at Vermont College of Fine Arts."
  },
  {
    "name":"Veronika Burian",
    "shortname":"Veronika_Burian",
    "company":"TypeTogether",
    "bio":"Veronika Burian, born in Prague, studied Industrial Design in Munich and worked in that capacity in Vienna and Milan over a few years. Discovering her true passion for type, she graduated with distinction from the MA in Typeface Design in Reading, UK, in 2003 and worked as type designer at DaltonMaag in London for a few years. After staying for some time in Boulder, USA, and her hometown Prague she is now enjoying life in sunny Cataluña. Veronika is co-founder of the independent type foundry TypeTogether, publishing award-winning typefaces and collaborating on tailored projects for a variety of clients."
  }
]  